# PyNeoInstance Analysis Demo

Data sourced from: https://www.kaggle.com/datasets/mexwell/countries-states-and-cities-around-the-world

In [1]:
import pandas as pd
from pyneoinstance import Neo4jInstance, load_yaml_file

/var/folders/7_/vqs74z3j5hscgzbt0ydbmqyw0000gq/T/ipykernel_96041/1670258370.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

## Load Configuration

In [2]:
config = load_yaml_file("config.yaml")
db_info = config['db_info']
queries = config['analysis_queries']

## Read Data From Graph

### Connect to Graph

In [3]:
graph = Neo4jInstance(db_info['uri'], db_info['user'], db_info['password'])

### Get Queries List

In [4]:
list(queries.keys())

['cities_per_country', 'number_countries_with_city_name', 'common_currency']

### Run Queries

In [5]:
print(queries['cities_per_country'])

match (co:Country)--(:State)--(ci:City)
return  co.name as name,
        count(ci) as numCities
order by numCities desc

In [6]:
cities_per_country = graph.execute_read_query(query=queries['cities_per_country'], database=db_info['database'])

In [7]:
cities_per_country

                      name  numCities
0            United States      19819
1                    Italy       9948
2                   Mexico       9331
3                   France       8894
4                    Spain       8433
..                     ...        ...
191                  Nauru          7
192        Solomon Islands          7
193                Vanuatu          7
194  Sao Tome and Principe          5
195            South Sudan          1

[196 rows x 2 columns]

In [8]:
number_countries_with_city_name = graph.execute_read_query(query=queries['number_countries_with_city_name'], database=db_info['database'])

In [9]:
number_countries_with_city_name

                  name  numCountries
0               Merkez            51
1           Santa Cruz            38
2           San Miguel            35
3          San Antonio            32
4           San Isidro            32
...                ...           ...
131992       Mancilang             1
131993  Nueva Vida Sur             1
131994         Malhiao             1
131995           Apoya             1
131996       Kandabong             1

[131997 rows x 2 columns]

In [10]:
common_currency = graph.execute_read_query(query=queries['common_currency'], database=db_info['database'])

In [11]:
common_currency

    name  numCountries                                          countries
0    EUR            35  [Finland, Mayotte, Ireland, Belgium, Portugal,...
1    USD            17  [Palau, Virgin Islands (British), Marshall Isl...
2    XCD             8  [Montserrat, Saint Vincent And The Grenadines,...
3    AUD             8  [Cocos (Keeling) Islands, Australia, Tuvalu, H...
4    XOF             8  [Guinea-Bissau, Cote D'Ivoire (Ivory Coast), B...
..   ...           ...                                                ...
151  VEF             1                                        [Venezuela]
152  VND             1                                          [Vietnam]
153  YER             1                                            [Yemen]
154  ZMW             1                                           [Zambia]
155  ZWL             1                                         [Zimbabwe]

[156 rows x 3 columns]